name: "TripleNet"


layer {
  name: "xmedia_img_pool5"
  type: "Data"
  top: "xmedia_img_pool5"
  data_param {
    source: "wiki_train_pool5/" #Set your path
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "xmedia_txt_data"
  type: "Data"
  top: "xmedia_txt_data"
  top: "xmedia_txt_label"
  data_param {
    source: "lmdb_train/"  #Set your path
    batch_size: 1
    backend: LMDB
  }
}

# ---------------------------------------------------------- fc6 of target

layer {
  name: "xmedia_img_fc6"
  type: "InnerProduct"
  bottom: "xmedia_img_pool5"
  top: "xmedia_img_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "xmedia_img_fc6/bn"
  type: "BatchNorm"
  bottom: "xmedia_img_fc6"
  top: "xmedia_img_fc6/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}
layer {
  name: "xmedia_img_relu6"
  type: "ReLU"
  bottom: "xmedia_img_fc6/bn"
  top: "xmedia_img_fc6/bn"
}


layer {
  name: "xmedia_img_fc7"
  type: "InnerProduct"
  bottom: "xmedia_img_fc6/bn"
  top: "xmedia_img_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "xmedia_img_fc7/bn"
  type: "BatchNorm"
  bottom: "xmedia_img_fc7"
  top: "xmedia_img_fc7/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}
layer {
  name: "xmedia_img_relu7"
  type: "ReLU"
  bottom: "xmedia_img_fc7/bn"
  top: "xmedia_img_fc7/bn"
}

# ---------------------------------------------------------- textNet

layer {
  name: "txt_data/bn"
  type: "BatchNorm"
  bottom: "xmedia_txt_data"
  top: "txt_data/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}
layer {
  name: "xmedia_txt_fc6"
  type: "InnerProduct"
  bottom: "txt_data/bn"
  top: "xmedia_txt_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "xmedia_txt_fc6/bn"
  type: "BatchNorm"
  bottom: "xmedia_txt_fc6"
  top: "xmedia_txt_fc6/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}
layer {
  name: "xmedia_txt_relu6"
  type: "ReLU"
  bottom: "xmedia_txt_fc6/bn"
  top: "xmedia_txt_fc6/bn"
}
layer {
  name: "xmedia_txt_fc7"
  type: "InnerProduct"
  bottom: "xmedia_txt_fc6/bn"
  top: "xmedia_txt_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "xmedia_txt_fc7/bn"
  type: "BatchNorm"
  bottom: "xmedia_txt_fc7"
  top: "xmedia_txt_fc7/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}
layer {
  name: "xmedia_txt_relu7"
  type: "ReLU"
  bottom: "xmedia_txt_fc7/bn"
  top: "xmedia_txt_fc7/bn"
}


# ---------------------------------------------------------- mergeNet

layer {
  name: "concat_fc7"
  type: "Concat"
  bottom: "xmedia_img_fc7/bn"
  bottom: "xmedia_txt_fc7/bn"
  top: "xmedia_fc7_concat"
  concat_param {
    concat_dim: 0
  }
}
layer {
  name: "xmedia_fc8"
  type: "InnerProduct"
  bottom: "xmedia_fc7_concat"
  top: "xmedia_fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "xmedia_relu8"
  type: "ReLU"
  bottom: "xmedia_fc8"
  top: "xmedia_fc8"
}
layer {
  name: "xmedia_fc9"
  type: "InnerProduct"
  bottom: "xmedia_fc8"
  top: "xmedia_fc9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "xmedia_relu9"
  type: "ReLU"
  bottom: "xmedia_fc9"
  top: "xmedia_fc9"
}
layer {
  name: "xmedia_fc10"
  type: "InnerProduct"
  bottom: "xmedia_fc9"
  top: "xmedia_fc10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "slice_fc10"
  type: "Slice"
  bottom: "xmedia_fc10"
  top: "xmedia_img_fc10"
  top: "xmedia_txt_fc10"
  slice_param {
    slice_dim: 0
  }
}

layer {
  bottom: "xmedia_img_fc10"
  top: "xmedia_img_prob"
  name: "xmedia_img_prob"
  type: "Softmax"
}
layer {
  bottom: "xmedia_txt_fc10"
  top: "xmedia_txt_prob"
  name: "xmedia_txt_prob"
  type: "Softmax"
}
